<html>

<head>

<title>FAQ - RR0-IS</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="rr0.css" type="text/css">
<script language="JavaScript">
<!--
function sendMail() {
address = "rr0";
domain = "rr0.org";
window.location="mailto:" + address + "@" + domain;
return true;
}
-->
</script>
</head>



<body>
<table border="0" cellspacing="0" cellpadding="0" class="noborder">
  <tr>
    <td class="noborder"><h1>Foire Aux Questions</h1></td>
    <td class="noborder"><ul>
        <li><a href="index.html">Home</a></li>
        <li><a href="#" onClick="sendMail();">Contact</a></li>
        <li><a href="FAQ.html">English translation</a></li>
        </ul>
    </td>
  </tr>
</table>
<ul>
  <li><a href="#HowToContribute">Comment participer ?</a></li>
  <li><a href="#Owns">A qui appartient le projet ?</a></li>
  <li><a href="#OpenSource">Qu'est-ce qu'un projet &quot;Open Source&quot; ?</a></li>
  <li><a href="#Change">Puis-je changer quelque chose dans le projet ?</a></li>
  <li><a href="#Cost">Combien cela co&ucirc;tera-t-il ?</a></li>
  <li><a href="#EndDate">Quand le projet sera-t-il termin&eacute; ?</a></li>
  <li><a href="#ProbableEnd">Quelle probabilit&eacute; pour que le projet arrive &agrave; son
  terme ?</a></li>
  <li><a href="#Name">Pourquoi appeler le projet &quot;UFO@home&quot; ?</a></li>
  <li><a href="#rr0">Pourquoi voit-on parfois le nom &quot;RR0&quot; ou &quot;UFO@home&quot; ?</a></li>
  <li><a href="#Who">Qui travaille sur le projet ?</a></li>
  <li><a href="#Opinion">Quelle est l'opinion du projet sur les OVNIs ?</a></li>
  <li><a href="#Partnership">Des partenariats sont-ils possibles
      ?</a></li>
  <li><a href="#Copyright">Pourquoi un copyright dans la licence du projet ?</a></li>
  <li><a href="#French">Pourquoi des pages en fran&ccedil;ais  ?</a></li>
  <li><a href="#RR0">Que va devenir RR0.org ?</a></li>
  <li><a href="#ChangeWeb">Peut-on changer le site web ; (sa forme, sa structure)
      ne me plait pas</a></li>
</ul>
<h2><a name="CommentParticiper"></a>Comment participer ?</h2>
<p>Cela d&eacute;pend de votre profil :</p>
<blockquote><table border="1" cellpadding="5" cellspacing="0">
  <tr>
    <th>R&ocirc;le</th>
    <th>Ce que vous pouvez faire</th>
  </tr>
  <tr>
    <td>Journaliste/&eacute;crivain</td>
    <td><ul>
        <li>Discuter des besoins m&eacute;tier sur la <a href="http://lists.sourceforge.net/lists/listinfo/rr0-domain">liste
            du domaine projet</a></li>
        <li>Devenir un repr&eacute;sentant de la communaut&eacute; des journalistes/&eacute;crivains
          pour le projet</li>
        <li>Parler, &eacute;crire des articles sur le projet</li>
    </ul>
    </td>
  </tr>
  <tr>
    <td>Enqu&ecirc;teur sur les OVNIs</td>
    <td><ul>
        <li>Discuter des besoins m&eacute;tier sur la <a href="http://lists.sourceforge.net/lists/listinfo/rr0-domain">liste
          du domaine projet</a></li>
        <li>Devenir un repr&eacute;sentant de la communaut&eacute; des enqu&ecirc;teurs
          pour le projet</li>
      </ul>
    </td>
  </tr>
  <tr>
    <td>T&eacute;moin</td>
    <td><ul>
        <li>Discuter des besoins m&eacute;tier sur la <a href="http://lists.sourceforge.net/lists/listinfo/rr0-domain">liste
          du domaine projet</a></li>
        <li>Devenir un repr&eacute;sentant de la communaut&eacute; des t&eacute;moins
          pour le projet</li>
      </ul>
    </td>
  </tr>
  <tr>
    <td>Scientists</td>
    <td><ul>
        <li>Discuter des besoins m&eacute;tier sur la <a href="http://lists.sourceforge.net/lists/listinfo/rr0-domain">liste
          du domaine projet</a></li>
        <li>Devenir un repr&eacute;sentant de la communaut&eacute; des scientifiques
          pour le projet</li>
      </ul>
    </td>
  </tr>
  <tr>
    <td>Amateurs du ph&eacute;nom&egrave;ne OVNI</td>
    <td><ul>
        <li>Discuter des besoins m&eacute;tier sur la <a href="http://lists.sourceforge.net/lists/listinfo/rr0-domain">liste
          du domaine projet</a></li>
        <li>Parler du projet dans les listes ovni</li>
        <li>Devenir un repr&eacute;sentant de la communaut&eacute; des amateurs
          du ph&eacute;nom&egrave;ne ovni pour le projet</li>
      </ul>
    </td>
  </tr>
  <tr>
    <td>Webmestre</td>
    <td><ul>
        <li>Discuter des besoins m&eacute;tier sur la <a href="http://lists.sourceforge.net/lists/listinfo/rr0-domain">liste
          du domaine projet</a></li>
        <li>Soutenir le projet en ajouter un lien vers le <a href="http://rr0.sourceforge.net">site
            web du projet</a></li>
      </ul>
    </td>
  </tr>
  <tr>
    <td>Organisation &eacute;tudiant les OVNIs</td>
    <td><ul>
        <li>Devenir un repr&eacute;sentant de la communaut&eacute; des organizations
          &eacute;tant les OVNIs pour le projet</li>
      </ul>
    </td>
  </tr>
  <tr>
    <td>Producteurs/ &eacute;diteurs</td>
    <td><ul>
      <li>Devenir un repr&eacute;sentant de la communaut&eacute; des producteurs/&eacute;diteurs
        pour le projet</li>
      </ul>
    </td>
  </tr>
  <tr>
    <td>Ing&eacute;nieur/ d&eacute;veloppeur/ consultant en logiciel</td>
    <td><ul>
        <li>Discuter des besoins techniques sur la <a href="http://lists.sourceforge.net/lists/listinfo/rr0-domain">liste
            des d&eacute;veloppeurs du projet</a></li>
        <li>Concevoir/d&eacute;velopper des parties du logiciel du projet</li>
      </ul>
    </td>
  </tr>
</table></blockquote>
<h2><a name="Owns"></a>A qui appartient le projet ?</h2>
<p> Le projet n'est pas propri&eacute;taire. Il n'appartient pas &#8212; et n'appartiendra
  pas &#8212; &agrave; une quelconque personne ou organisation. Ceci parce
  que son but est de fournir des standards et outils pour la communaut&eacute; ufologique
  dans son ensemble. Ceci est garanti par la license <a href="License_fr.html">Open
  Source</a> du projet.</p>
<h2><a name="OpenSource"></a>Qu'est-ce qu'un projet &quot;Open Source&quot; ?</h2>
<p>Open Source (&quot;logiciel libre&quot; en fran&ccedil;ais) signifie que le
  code source du logiciel est disponible pour tout le monde. Chacun est autoris&eacute; &agrave; l'utiliser,
  le distributer, le modifier, ou m&ecirc;me le vendre - mais ce n'est alors
  plus le probl&egrave;me du projet - librement. Cela veut &eacute;galement dire
  que vous pourrez inspecter/lire ce que le code source fait vraiment (i.e. que
  ce n'est pas un logiciel espion ni un virus, etc.)</p>
<h2><a name="Change"></a>Puis-je changer quelque chose dans ce projet ?</h2>
<p>Ce projet est le v&ocirc;tre. Plus vous vous y impliquerez, et plus il r&eacute;pondra
  &agrave; vos besoins, et plus il &eacute;vitera les eccueils que vous voulez &eacute;viter
  pour un tel projet. Un projet ne peut r&eacute;ussir s'il ne r&eacute;pond
  pas au besoin de ses utilisateurs. N'h&eacute;sitez pas &agrave; vous inscrire &agrave; une
  liste de discussion du projet &#8212; <a href="http://lists.sourceforge.net/lists/listinfo/rr0-domain">rr0-domain</a> pour
  son aspect ufologique, <a href="https://lists.sourceforge.net/lists/listinfo/rr0-developers">rr0-developers</a> pour
  son aspect technique, etc. &#8212; pour discuter du projet.</p>
<h2><a name="Cost"></a>Combien cela co&ucirc;tera-t-il ?</h2>
<p>Le projet est gratuit. Il ne b&eacute;n&eacute;ficie &agrave; ce jour d'aucun financement, et les
  efforts de travail ne sont pas r&eacute;mun&eacute;r&eacute;s. Cependant, les r&eacute;sultats de ce projet
  seront mis gratuitement &agrave; la disposition du public - dont les personnes et
  les organisations int&eacute;ress&eacute;es par l'&eacute;tude des OVNIs - pour l'utilisation qui
  leur plaira. Une Impl&eacute;mentation de R&eacute;f&eacute;rence sera tout de m&ecirc;me fournie au public
  gratuitement.</p>
<h2><a name="EndDate" id="EndDate"></a>Quand le projet sera-t-il termin&eacute;  ?</h2>
<p>C'est assez difficile &agrave; pr&eacute;dire pour un projet Open Source, o&ugrave; le rythme de
  travail d&eacute;pend du nombre de participants,
  et du temps disponibles de ceux-ci.
  Cela peut donc prendre encore un an ou cinq, cela d&eacute;pend de votre volont&eacute; d'y
  travailler.</p>
<h2><a name="ProbableEnd"></a>Quelle probabilit&eacute; que ce projet arrive &agrave; son terme ?</h2>
<p>Le projet sera termin&eacute;, quels que soient les &quot;hauts et bas&quot;.
  En plus de son int&eacute;r&ecirc;t principal (faire avancer l'ufologie d'un grand pas)
  est son int&eacute;r&ecirc;t technique pour divers ing&eacute;nieur en informatique. UFO@home est
  donc un double d&eacute;fi.</p>
<h2><a name="Name"></a>Pourquoi appeler le projet &quot;UFO@home&quot; ?</h2>
<p>UFO@home (prononcer &quot;UFO at home&quot;) d&eacute;signe la capacit&eacute; pour tout un chacun
  de t&eacute;moigner, consulter et travailler sur les ovnis depuis chez lui, &agrave; l'aide
  d'une connexion Internet. Comme le projet SETI@home  &#8212; avec qui il n'a
  aucune relation &#8212; dont
  il s'inspire du nom, il permettra aussi peut &ecirc;tre de distribuer un calcul lourd
(statistique par exemple) sur plusieurs serveurs UFO@home.</p>
<h2><a name="rr0" id="rr0"></a>Pourquoi voit-on parfois le nom &quot;RR0&quot; ou &quot;UFO@home&quot;
  ?</h2>
<p>RR0 est le nom du site Web qui initia le projet, qui prit d'abord le nom de
  UFO@home (<em>RR0
    Information System</em>, syst&egrave;me d'information de RR0), avant de s'appeler
    UFO@home. On peut donc voir ici o&ugrave; l&agrave; &quot;rr0&quot;, le nom de code historique
    du projet.</p>
<h2><a name="Who"></a>Qui travaille sur le projet ?</h2>
<p>Diverses personnes, qu'elles aient des profils m&eacute;tier (sp&eacute;cialistes 
  de l'ufologie) ou techniques (en informatique typiquement). Toutes les bonnes 
  volont&eacute;s sont les bienvenues sur ce projet.</p>
<h2><a name="Opinion"></a>Quel est le point de vue du projet sur les ovnis ?</h2>
<p>Le projet UFO@home vise &agrave; d&eacute;velopper un outil permettant d'&eacute;tudier plus efficacement
  le ph&eacute;nom&egrave;ne ovni, et &agrave; ce titre n'a aucun jugement sur le ph&eacute;nom&egrave;ne en lui-m&ecirc;me.
  Il reconna&icirc;t simplement le ph&eacute;nom&egrave;ne comme r&eacute;el, ayant un int&eacute;r&ecirc;t scientifique
  potentiel, mais ne conclue pas sur une explication de ce ph&eacute;nom&egrave;ne. Il ne rejette
  aucune hypoth&egrave;se, et vise justement &agrave; permettre au plus grand nombre (partistants
  de l'HPS, de l'HET, etc.) de travailler sur les m&ecirc;mes donn&eacute;es, mais selon leurs
  propres m&eacute;thodes.</p>
<h2><a name="Partnership"></a>Des partenariats sont-ils
  envisag&eacute;s
  ?</h2>
<p>Toute organisation est la bienvenue pour participer au projet. Par contre il 
  n'est pas envisag&eacute; &agrave; ce jour de placer le projet sous la coupe 
  d'une organisation existante, afin d'&eacute;viter les querelles de clocher.</p>
<h2><a name="Copyright"></a>Pourquoi il y a-t-il un copyright dans la licence
  du projet ?</h2>
<p>Le copyright d'un logiciel <a href="http://javarome.net/OpenSource.html">OSS</a> 
  est qualifi&eacute; de <em>copyleft</em>, puisque son but est de laisser les 
  utilisateurs le droit d'utiliser, redistribuer et modifier le logiciel librement. 
  Au contraire de logiciels sans <a href="http://javarome.net/Licence.html">licence</a> 
  (du domaine public, qui n'impose rien ni son contraire), l'existence de ce copyright 
  permet d'obliger &agrave; respecter ces droits. </p>
<p>Comme indiqu&eacute; dans la licence, le fait que le copyright soit pour l'instant 
  au nom de &quot;J&eacute;r&ocirc;me Beau&quot; (cr&eacute;ateur de RR0.org) 
  n'influence en rien les droits d'utilisation, diffusion, modification reconnus 
  par la licence. Il s'agit juste d'une reconnaissance de l'auteur de l'initiative. 
  Par la suite si une entit&eacute; organisationnelle se cr&eacute;ait pour g&eacute;rer 
  UFO@home, le copyright serait au nom de cette entit&eacute; (il est diffile d'envisager 
  une association ufologique existante afin de ne pas donner au projet une couleur 
  partisane).</p>
<h2><a name="French"></a>Pourquoi des pages en  fran&ccedil;ais ?</h2>
<p>Les pages du projet sont disponibles en fran&ccedil;ais et en anglais.
  La traduction allemande provident
d'un traducteur en ligne automatis&eacute;.</p>
<h2><a name="RR0"></a>Que va devenir RR0.org ?</h2>
<p>Le site statique RR0.org va continuer &agrave; exister parall&egrave;lement 
  &agrave; UFO@home. Une fois UFO@home achev&eacute; et l'ensemble des donn&eacute;es 
  statiques migr&eacute;es dans la version dynamique, la version statique dispara&icirc;tra.</p>
<h2><a name="ChangeWeb"></a>Peut-on changer le site Web (sa forme, sa stucture) ne me plait pas</h2>
<p>Ce site Web est celui du projet UFO@home, est non du produit fini. Toutefois, 
  comme pour le produit fini, il peut &ecirc;tre remis en cause. Rien n'est immuable 
  et d&eacute;finitif dans ce projet, et toutes les remarques sont les bienvenues.</p>
</body>

</html>

