<html>
<head>
<title>Ajouter un cas - Expression des besoins m&eacute;tier - RR0-IS</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"/>
<link rel="stylesheet" href="rr0.css" type="text/css"/>
</head>

<body>
<h1>Ajouter un cas</h1>
<table width="100%" border="0" cellpadding="0" cellspacing="0">
  <tr> 
    <th colspan="4"><a href="index_fr.html">UFO@home</a>&nbsp;&gt;&nbsp;<a href="RequirementsBusiness_fr.html">Expression 
      des besoins m&eacute;tier</a> &gt; <a href="UseCases.html">Cas d'utilisation</a></th>
  </tr>
</table>
<h2>Objectif</h2>
<p> Permettre &agrave; tout <strong>observateur</strong> d'enregistrer une observation 
  qu'il n'a pas su expliquer.</p>
<h2><img src="images/CaseAdd.gif" width="341" height="211"></h2>
<h2>Description</h2>
<p>L'observateur pr&eacute;cise les donn&eacute;es <a href="UUDF.html">UUDF</a>, 
  dont le <strong>lieu</strong> (via une s&eacute;lection pr&eacute;cise sur une 
  carte), la <strong>date </strong>et l'<strong>heure </strong>et son <strong>orientation 
  </strong>au moment de son observation. Si les renseignement sont suffisants 
  pour cela, le site propose une <strong>carte du ciel </strong>&agrave; ce moment-l&agrave;, 
  avec les <strong>objets connus comme visibles </strong>(&eacute;toiles, plan&egrave;tes, 
  satellites, com&egrave;tes, supernovae, fus&eacute;es et d&eacute;bris, voire 
  avions) &agrave; ce moment-l&agrave;. Sur ce ciel reconstitu&eacute; l'interface 
  permet &agrave; l'observateur de <strong>dessiner ce qu'il a vu</strong>, soit 
  librement, soit en choisissant un ou plusieurs &quot;objets&quot; dans un catalogue 
  de formes et de contours, et d'indiquer la trajectoire pr&eacute;cis&eacute;ment. 
  Il peut &eacute;galement appliquer divers effets lumineux, couleurs, textures. 
  Au terme de ce sch&eacute;ma <strong>l'observation peut &ecirc;tre simul&eacute;e 
  par une animation</strong>.</p>
<p>Apr&egrave;s enregistrement de ces informations, <strong>une <a href="CaseSearchUC.html">identification 
  du cas</a> est men&eacute;e</strong>. Si elle n'aboutit pas, le syst&egrave;me 
  indique &agrave; l'observateur que son t&eacute;moignage va &ecirc;tre examin&eacute; 
  plus avant. L'observateur peut alors <strong>laisser ses coordonn&eacute;es 
  (qui resteront confidentielles</strong> : nom, pr&eacute;nom, adresse, email) 
  pour &ecirc;tre contact&eacute; si besoin par un enqu&ecirc;teur. L'observateur 
  peut alors indiquer s'il souhaite &ecirc;tre notifi&eacute; des &eacute;v&eacute;nements 
  concernant son cas (commentaires d'utilisateurs, identification trouv&eacute;e).</p>
<p><img src="images/CaseAddActivity.gif" width="591" height="471"></p>
<p>En aucun cas l'observateur n'est invit&eacute; &agrave; classifier son cas.</p>
<table width="100%" border="0" cellpadding="0" cellspacing="0">
  <tr> 
    <th colspan="4"><a href="index_fr.html">UFO@home</a>&nbsp;&gt;&nbsp;<a href="RequirementsBusiness_fr.html">Expression 
      des besoins m&eacute;tier</a> &gt; <a href="UseCases.html">Cas d'utilisation</a></th>
  </tr>
</table>
</body>

</html>

