<html>

<head>
<title>Java - Ufomatics</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="rr0.css" rel="stylesheet" type="text/css">
<script language="JavaScript">
<!--
function sendMail() {
address = "rr0";
domain = "rr0.org";
window.location="mailto:" + address + "@" + domain;
return true;
}
-->
</script>
</head>
<body>
<h1>Java</h1>
<table width="100%" border="0" cellpadding="0" cellspacing="0">
<tr>
<th nowrap colspan="4"><a href="/index_fr.html">Home</a>&nbsp;&nbsp;&gt;&nbsp;&nbsp;<a href="Java.html">English translation</a></th>
</tr>
</table>
<p>Java est plus connu comme un langage de programmation, qui a &eacute;merg&eacute; en 1995 en m&ecirc;me temps que l'Internet pour le grand public. A cette &eacute;poque, sa caract&eacute;ristique la plus connue &eacute;tait sa capacit&eacute; &agrave; construire des <cite>applets</cite> (petites applications) pouvant &ecirc;tre incluses dans des pages web, fournissant ainsi de nouvelles capacit&eacute;s d'interactivit&eacute; et de calcul pouvant &ecirc;tre facilement d&eacute;ploy&eacute;es sur n'importe quelle machine. Pour parvenir &agrave; ce but, Java fut con&ccedil;u pour &ecirc;tre <cite>ind&eacute;pendant de la machine</cite> (ind&eacute;pendant de PC ou de Mac, s'ex&eacute;cutant dans une <cite>machine virtuelle</cite>, qui est en fait un logiciel install&eacute; sur votre poste), <cite>dynamique</cite> (il t&eacute;l&eacute;charge des bouts de logiciels ou de donn&eacute;es uniquement lorsqu'il en a besoin et non pas &agrave; l'avance), et <cite>adapt&eacute; aux r&eacute;seaux</cite> (et donc &agrave; l'Internet, de part sa petite taille et sa capacit&eacute; &agrave; s'ex&eacute;cuter dans des navigateurs web). </p>
<p>Depuis cette &eacute;poque, Java a &eacute;volu&eacute; en une plate-forme plus grande, solide et fiable, largement utilis&eacute;e dans la plupart des entreprises. Il fourni beaucoup de librairies d&eacute;j&agrave; int&eacute;gr&eacute;es, et plus encore de librairies optionnelles destin&eacute;es &agrave; des buts plus sp&eacute;cifiques, tels que le multimedia, le dessin 2D ou 3D.</p>
<p>Il existe des Machines Virtuelles  Java (JVM) pour Windows (de Sun, IBM ou Microsoft), Apple, Unix (Linux, Solaris, HP-UX), ou des PDAs ( (Palm Pilot, etc.). La plupart des navigateurs (IE, Firefox, Mozilla, etc.) incluent une JVM.</p>
<p><strong>R&eacute;f&eacute;rences </strong>:</p>
<ul>
<li><a href="http://java.sun.com/">Java technology</a> de Sun Microsystems - Le site officiel de Java</li>
<li><a href="http://javarome.net">Javarome.net</a> - Donn&eacute;es de r&eacute;f&eacute;rences sur Java</li>
</ul>
<table width="100%" border="0" cellpadding="0" cellspacing="0">
<tr>
<th nowrap colspan="4"><a href="/index_fr.html">Home</a>&nbsp;&nbsp;&gt;&nbsp;&nbsp;<a href="Java.html">English translation</a></th>
</tr>
</table>
<p>&nbsp;</p>
</body>

</html>

