<h1>Glossaire</h1>
<ul>
  <table border="0" align="center" cellpadding="5" cellspacing="0">
    <tr>
      <td valign="top"><ul>
          <li> <strong><a href="#Introduction">Introduction</a></strong>
              <ul>
                <li><a href="#Objectif">Objectif</a></li>
                <li> <a href="#Perimetre">P&eacute;rim&egrave;tre</a></li>
                <li><a href="#References">R&eacute;f&eacute;rences</a></li>
                <li><a href="#VueDEnsemble">Vue d'ensemble</a></li>
              </ul>
          </li>
          <li><strong><a href="#Definitions">D&eacute;finitions</a></strong>
              <ul>
                <li><a href="#Projet">Projet</a></li>
                <li><a href="#Domaine">Domaine m&eacute;tier</a></li>
                <li><a href="#Technique">Technique</a></li>
              </ul>
          </li>
          </ul>
      </td>
    </tr>
  </table>
</ul>
<h2><a name="Introduction"></a>Introduction</h2>
<h3> <a name="Objectif"></a>Objectif</h3>
<p>Ce document est utilis&eacute; pour d&eacute;finir la terminologie sp&eacute;cifique
  au domaine ufologique, expliquant des termes qui pourraient &ecirc;tre non
  familiers au lecteur des descriptions de cas d'utilisation ou d'autres documents
  du projet. Ce document
  peut &ecirc;tre utilis&eacute; comme un dictionnaire de donn&eacute;es informel,
  capturant les d&eacute;finitions de donn&eacute;es de mani&egrave;re &agrave; ce
  que les autres documents du projet puissent se focaliser sur ce que le syst&egrave;me
  doit faire de l'information.</p>
<h3> <a name="Perimetre"></a>P&eacute;rim&egrave;tre</h3>
<p>Ce document s'applique au projet UFO@home. Il affecte l'ensemble
des besoins et de la conception de UFO@home.</p>
<h3> <a name="References"></a>R&eacute;f&eacute;rences</h3>
<ol>
  <li><a href="http://rr0.org">RR0</a> &#8212; Site web amateur contenant de
    nombreuses d&eacute;finitions relatives du domaine ufologique.</li>
  <li><a href="http://javarome.net">Javarome.net</a> &#8212; Site web amateur
    contenant de nombreuses d&eacute;finitions et documentations sur le d&eacute;veloppement
    logiciel et  Java.</li>
</ol>
<h3><a name="VueDEnsemble"></a>Vue d'ensemble</h3>
<p>Les termes du chapitre de d&eacute;finitions suivant forment la substance
  essentielle
de ce document. Ils sont d&eacute;finis par cat&eacute;gorie, puis par ordre alphabetique.</p>
<h2><a name="Definitions"></a>D&eacute;finitions</h2>
<h3><a name="Projet"></a>Projet</h3>
<h4>RR0</h4>
<p> <em>Rencontre Rapproch&eacute;e 0</em>. Nom historique d'un <a href="http://rr0.org">site
    web ufologique</a> qui a initi&eacute; le projet UFO@home.</p>
<h4>RR0 IM</h4>
<p> RR0 Information Model : Mod&egrave;le d'Information de UFO@home. Ensemble
  de concepts manipul&eacute;s
  en ufologie, tels qu'il vont &ecirc;tre utilis&eacute;s par UFO@home.</p>
<h4>Repr&eacute;sentant</h4>
<p>Ou <em>Stakeholder</em>. Personne affect&eacute;e par l'existance de UFO@home.
Inclut les utilisateurs de UFO@home.</p>
<h4>Utilisateur</h4>
<p> Personne qui utilisera le produit UFO@home, une fois achev&eacute;.</p>
<h3><a name="Domaine"></a>Domaine m&eacute;tier</h3>
<h4><a name="AIAA"></a>AIAA</h4>
<p> American Institute of Aeronautics and Astronautics : Institut Am&eacute;ricain d'A&eacute;ronautique
  et d'Astronautique.</p>
<p>En Novembre 1970 le sous-comit&eacute; OVNI de l'AIAA publie dans <em>Aeronautics
    and Astronautics</em> (Vol. 8. No. 11,
P. 49-51) un article intitul&eacute; <em><a href="http://rr0.free.fr/1970-11_AeronauticsAndAstronautics.html">UFO:
An Appraisal of the Problem</a></em>.</p>
<h4>Cas</h4>
<p> Un &eacute;v&eacute;n&eacute;nement ufologique majeur (observation, enl&egrave;vement, etc.) qui n&eacute;cessite
  ou a n&eacute;cessit&eacute; une enqu&ecirc;te.</p>
<h4>Cat&eacute;gorie</h4>
<p> Un ensemble de crit&egrave;res correspondant &agrave; une selection de donn&eacute;es.</p>
<h4>Classification </h4>
<p>Un ensemble nomm&eacute; de cat&eacute;gories mutuellement exclusives.</p>
<h4 name="UFO">OVNI</h4>
<p name="UFO"> Object Volant Non Identifi&eacute;. Un ph&eacute;nom&egrave;ne a&eacute;rien inexpliqu&eacute;, parfois
  avec un haut degr&eacute; d'&eacute;tranget&eacute;.</p>
<h4 name="UFO"><a name="UFO"></a>UFO</h4>
<p name="UFO"> Unidentified Flying
    Object. Equivalent anglophone d'OVNI.</p>
<h4>Ph&eacute;nom&egrave;ne OVNI</h4>
<p> L'ensemble des &eacute;v&eacute;nements inexpliqu&eacute;s et peut-&ecirc;tre li&eacute;s impliquant des <a href="#UFO">OVNI</a>s.</p>
<h4>Ufologique</h4>
<p> Relatif &agrave; l'<a href="#Ufology">ufologie</a>.</p>
<h4 name="Ufology"><a name="Ufology"></a>Ufologie</h4>
<p name="Ufology"> Etude du ph&eacute;nom&egrave;ne OVNI.</p>
<h3 name="Ufology"><a name="Technique"></a>Technique</h3>
<h4 name="Ufology">Applet</h4>
<p name="Ufology">(Litt&eacute;ralement &quot;petite application&quot;) Petit programme s'ex&eacute;cutant/s'affichant
  dans une page Web. UFO@home d&eacute;finit par exemple une applet permettant &agrave; un t&eacute;moin
  de d&eacute;crire visuellement son observation via Internet.</p>
<h4><a name="API"></a>API</h4>
<p>Application Programming Interface. Interface de Programmation d'Application.
  Ensemble d'interfaces (parfois de classes) et d'op&eacute;rations associ&eacute;es (m&eacute;thodes)
  visibles de l'appelant d'un composant logiciel. Une API est &eacute;crite dans/pour
  un langage de programmation donn&eacute;, comme Java.</p>
<p>Des exemples d'API sont le standard Java JDO (Java Data Objects) ou l'API
  Java RR0 IM (UFO@home Information Model).</p>
<h4><a name="CRUD"></a>CRUD</h4>
<p><em>Create, Retrieve, Update, Delete</em>. Cr&eacute;ation, R&eacute;cup&eacute;ration, Mise &agrave;
  jour, Suppression. Op&eacute;rations basiques sur une base de donn&eacute;es.</p>
<h4><a name="HTML"></a>HTML</h4>
<p><em>HyperText Markup Language</em>. Langage de balises pour l'hypertexte.
  Le langage pour d&eacute;crire/&eacute;crire des pages Web pages envoy&eacute;es par un serveur
  Web vers un client  Web (navigateur).
  L'HTML est maintenu par le W3C (World
  Wide Web Consortium).</p>
<h4>HTTP </h4>
<p><em>HyperText Transfer Protocol</em>. Protocol de transfert de donn&eacute;es hypertextes.
  Le protocole r&eacute;seau entre un navigateur Web et un serveur Web. Situ&eacute; au-dessus
  du protocole TCP/IP.</p>
<h4><a name="Implementation"></a>Impl&eacute;mentation</h4>
<p>(Anglicisme, parfois traduit en fran&ccedil;ais par &quot;implantation&quot;). Action d'&eacute;crire
  un programme. Egalement utilis&eacute; pour d&eacute;crire le r&eacute;sultat de cette action, c'est-&agrave;-dire
  le programme lui-m&ecirc;me.</p>
<h4>Interface</h4>
<p>El&eacute;ment permettant de d&eacute;finir une interaction entre deux autres &eacute;lements.
  Par exemple UFO@home d&eacute;finit des &quot;interfaces utilisateur&quot;, permettant &agrave; une
  personne d'interagir avec des &eacute;l&eacute;ments logiciel comme l'applet de t&eacute;moignage
  d'ovni ou un formulaire &agrave; remplir sur le Web. Egalement utilis&eacute; pour d&eacute;crire
  des interactions entre des &eacute;lements purement logiciels, tels que deux objets
  informatique (il existe une interface pour d&eacute;crire la relation entre un objet
  t&eacute;moin et un objet t&eacute;moignage par exemple). UFO@home d&eacute;finit tout un ensemble
  d'interfaces logicielles, et laisse la libert&eacute; &agrave; tous de fournir des <a href="#implementation">impl&eacute;mentations</a>  de ces interfaces.</p>
<h4><a name="J2SE" id="J2SE"></a>J2SE</h4>
<p><em>Java 2 Standard Edition</em>. Edition Standard de Java 2. La plate-forme
  logicielle standard pour ex&eacute;cuter des programmes Java.</p>
<h4><a name="JDO" id="JDO"></a>JDO</h4>
<p><em>Java Data Objects</em>. Objets de donn&eacute;es Java. Une API Java standard
  permettant &agrave; des objets Java de persister de mani&egrave;re transparente dans tout
  support de stockage (SGBDR, SGBDO, etc.).</p>
<h4>UUDF </h4>
<p><em>Uniform Ufological Data Format</em>. Format de donn&eacute;es ufologiques uniforme.
  Un format de donn&eacute;es bas&eacute; sur XML visant &agrave; d&eacute;crire toute donn&eacute;e ufologique
  d'une mani&egrave;re standard et compatibles avec les serveurs Web.</p>
<h4><a name="UML"></a>UML</h4>
<p><em>Unified Modeling Language</em>. Langage unifi&eacute; de mod&eacute;lisation. Un formalisme
  standard d&eacute;finissant des types de diagrammes et des symboles pour repr&eacute;senter
  les s&eacute;mantiques de besoin, analyse, conception et d&eacute;ploiement de mani&egrave;re
  standardis&eacute;e.</p>
<h4>XML</h4>
<p><em>Extensible Markup Language</em>. Langage extensible de balises. Un langage
  de balises hi&eacute;rarchiques personnalisables.</p>
<h4>Service Web</h4>
<p>Une sp&eacute;cification pour l'int&eacute;rop&eacute;rabilit&eacute; (l'&eacute;change de donn&eacute;es) entre application
  via Internet.</p>
<h4>W3C</h4>
<p><em>Word Wide Web Consortium</em>. Consortium du Web mondial. L'organisation
  qui d&eacute;finit les standard du WebWeb.</p>
