<html>

<head>
<title>Observation visuelle directe depuis le sol - RR0-IS</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../../rr0.css" rel="stylesheet" type="text/css">
</head>
<body>
<h1>Observation visuelle directe depuis le sol</h1>
<table width="100%" border="0" cellpadding="0" cellspacing="0">
  <tr>
    <th colspan="4"><a href="../../index.html">Home</a> &nbsp;&gt;&nbsp;&nbsp;<a href="../index.html">Sighting home</a> &nbsp;| &nbsp;<a href="PhenomenonVisualEdit.html">English translation</a></th>
  </tr>
</table>
<p>Ci-dessous va appara&icirc;tre une repr&eacute;sentation du ciel sur laquelle vous allez pouvoir repr&eacute;senter ce que vous
  avez vu sur ce ciel :</p>
<p>
  <applet width="870" height="300" code="org.rr0.is.presentation.view.report.applet.ReportApplet" archive="ReportApplet.jar">
  </applet>
</p>
<ol>
  <li>Sur l'onglet &quot;<strong>T&eacute;moin</strong>&quot;, remplissez les informations vous concernant. Ce n'est pas obligatoire, mais aidera &agrave; obtenir plus d'information de votre part. Votre anonymat sera garanti.</li>
  <li>Indiquez le <strong>temps </strong>de d&eacute;part de votre observation :
      <ol>
        <li>Remplissez les champs de date et heure</li>
        <li>Pressez [Entr&eacute;e] sur un des champs de temps. Cela r&eacute;initialise le d&eacute;but de l'observation au moment que vous avez indiqu&eacute;.</li>
      </ol>
</li>
  <li>Indiquez votre <strong>position</strong> : 
    <ol>
      <li>S&eacute;lectionnez votre pays et ville. Vous pouvez &eacute;galement sp&eacute;cifier directement les latitude et longitude de votre observation si vous les connaissez. </li>
      <li>S&eacute;lectionnez votre orientation en la choisissant dans la liste d&eacute;roulante ou en ajustant la barre de d&eacute;filement horizontale situ&eacute;e sous la repr&eacute;sentation du ciel</li>
      <li>S&eacute;lectionnez l'altitude de votre vue en ajustant la barre de d&eacute;filement verticale sur la gauche de la repr&eacute;sentation du ciel. Vous pouvez &eacute;galement la saisir directement en degr&eacute;s dans la champ pr&eacute;vu &agrave; cet effet.</li>
    </ol>
  </li>
  <li>Indiquez les circonstances de votre observation.</li>
  <li>Dessinez l'<strong>apparence </strong>de l'ovni :
    <ol>
    <li>S&eacute;lectionnez l'onglet &quot;Aspect&quot;</li>
      <li>S&eacute;lectionnez une forme de base (ronde, carr&eacute;e, triangulaire)</li>
      <li>Cliquez la forme sur le ciel</li>
      <li>Vous pouvez maintenant changer
          <ol>
          <li>la couleur de la forme s&eacute;lectionn&eacute;e en cliquant sur la palette de couleur, ou en ajustant les barre des teinte, saturation et brillante</li>
            <li>la taille de la forme s&eacute;lectionn&eacute;e en s&eacute;lectionnant et d&eacute;pla&ccedil;ant les &quot;poign&eacute;es&quot; carr&eacute;es de la s&eacute;lection en cours</li>
          </ol>
      </li>
      <li>Vous pouvez r&eacute;p&eacute;ter cette op&eacute;ration plus fois depuis 2) pour &eacute;laborer une repr&eacute;sentation plus complexe de l'ovni que vous avez vu, comme compos&eacute; de plusieurs formes, chacune ayant ses propres couleur et taille. Ces formes suppl&eacute;mentaires peuvent &ecirc;tre associ&eacute;es au m&ecirc;me ovni, ou &agrave; un autre ovni observ&eacute;.</li>
    </ol>
  </li>
  <li>  Enregistrez le <strong>comportement </strong>de l'ovni&nbsp;:
    <ol>
      <li>Pressez le bouton rouge d'&quot;enregistrement&quot;</li>
      <li>D&eacute;placez le curseur de la souris sur le ciel : vous pouvez voir l'ovni courant se d&eacute;placer avec votre souris.</li>
      <li>Pour enregistrer la trajectoire de l'ovni, d&eacute;placez l'ovni, bouton de la souris enfonc&eacute;, selon la trajectoire que vous l'avez vue parcourir. </li>
      <li> Rel&acirc;cher le bouton de la souris lorsque vous souhaitez arreter l'enregistrement. </li>
      <li>Pour visualiser la sc&egrave;ne enregistr&eacute;e, d&eacute;placez le curseur de temps ou cliquez sur le bouton &quot;play&quot;.</li>
    </ol>
  </li>
</ol>
<p><strong>Sc&eacute;narios d'utilisation/astuces :</strong></p>
<ul>
  <li> <strong>plusieurs ovnis vus ensemble </strong>: enregistrez la premi&egrave;re trajectoire d'ovni, puis revenez au d&eacute;but de l'enregistrement &agrave; l'aide du curseur de temps, puis enregistrez la trajectoire du second ovni &agrave; partir de ce moment de d&eacute;part (vous verrez le premier ovni effectuer sa trajectoire pendant votre 2&egrave;me enregistrement), et ainsi de suite.</li>
<li> <strong>ovni changeant la couleur/taille </strong>de ses formes durant l'observation : enregistrez la trajectoire de l'ovni, puis, en utilisant le curseur de temps, revenez au moment o&ugrave; il a chang&eacute; de couleur. S&eacute;lectionnez l'onglet &quot;Aspect&quot; puis la forme ayant chang&eacute; de couleur &agrave; ce moment et cliquez sur la nouvelle couleur qu'elle a pris &agrave; ce moment. R&eacute;p&eacute;tez l'op&eacute;ration aux moment de l'observation de votre choix. Ceci peut &eacute;galement &ecirc;tre adopt&eacute; pour reproduire un comportement de clignotement (la couleur changement d'un moment &agrave; un autre vers le rouge, le blue, le vert, puis &agrave; nouveau le rouge, le bleu, le vert, etc.). Le m&ecirc;me principe peut &ecirc;tre utilis&eacute; pour le changement de taille.</li>
<li><strong>D&eacute;crire diff&eacute;rents moments de l'observation</strong> : en utilisant le curseur de temps, s&eacute;lectionnez un moment de votre observation, puis ajouter vos commentaires pour ce moment dans le champ &quot;description&quot; de l'onglet &quot;Circonstances&quot;. Puis positionnez-vous &agrave; un autre moment, ajouter &agrave; nouveau dans le m&ecirc;me champ d'autres commentaires pour cet autre moment, et ainsi de suite.</li>
</ul>
<table width="100%" border="0" cellpadding="0" cellspacing="0">
  <tr>
    <th colspan="4"><a href="../../index.html">Home</a> &nbsp;&gt;&nbsp;&nbsp;<a href="../index.html">Sighting home</a> &nbsp;| &nbsp;<a href="PhenomenonVisualEdit.html">English translation</a></th>
  </tr>
</table>
</body>

</html>

