<html>
<head>
<title>Fonctionnalti&eacute;s Archipelago - Ufomatics</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../rr0.css" rel="stylesheet" type="text/css">
</head>
<body>
<h1>Fonctionnalit&eacute;s</h1>
<table width="100%" border="0" cellpadding="0" cellspacing="0">
<tr>
<th nowrap colspan="4"><a href="/">Home</a>&nbsp;&nbsp;&gt;&nbsp;&nbsp;<a href="index.html">Archipelago</a> &nbsp;|&nbsp;&nbsp;<a href="Rationale_fr.html">Traduction fran&ccedil;aise</a> </th>
</tr>
</table>
<h2>Mod&egrave;le de donn&eacute;es personnalisable</h2>
<p>Le but d'Archipelago n'est pas seulement de fournir &agrave; l'utilisateur une vue unifi&eacute;e des bases de donn&eacute;es ufologiques existantes, mais aussi de lui permettre d'afficher et manipuler un model qui r&eacute;ponde &agrave; ses propres besoins et contraintes. Pour cette raison le <a href="Metadata_fr.html">m&eacute;ta mod&egrave;le</a> peut &ecirc;tre sp&eacute;cifique &agrave; l'utilsiateur, ou partag&eacute; parmi plusieurs utilisateurs/groupes.</p>
<h2>Fusion de donn&eacute;es</h2>
<p>En r&eacute;cup&eacute;rant des donn&eacute;es de sources diff&eacute;rentes, Archipelago peut aboutir &agrave; l'un des conclusions et des actions suivantes&nbsp;:</p>
<ul>
<li>les donn&eacute;es sont diff&eacute;rentes
<ul>
<li>elles traitent du m&ecirc;me &eacute;v&eacute;nement
<ul>
<li>elles ont des s&eacute;mantiques diff&eacute;rentes
<ul>
<li>on les ajoute</li>
</ul>
</li>
<li>elles ont des s&eacute;mantiques diff&eacute;rentes
<ul>
<li>on essaye de les fusionner
<ul>
<li>elles sont fusionnables</li>
<li>elles ne sont pas fusionnables
<ul>
<li>on les ajoute</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li>elles traitent d'&eacute;v&eacute;nements diff&eacute;rents
<ul>
<li>on les ajoute</li>
</ul>
</li>
</ul>
</li>
<li>les donn&eacute;es sont identiques (&agrave; des conversions pr&egrave;s)
<ul>
<li>on les fusionne</li>
</ul>
</li>
</ul>
<h2>Processus personnalis&eacute;s</h2>
<p>L'utilisateur doit &ecirc;tre capable d'appliquer ses propres <a href="Processes_fr.html">processus</a> aux donn&eacute;es repr&eacute;sent&eacute;es par le meta mod&egrave;le. De tels <a href="Processes_fr.html">processus</a> sont typiquement li&eacute;s &agrave; un meta mod&egrave;le donn&eacute; et peuvent &ecirc;tre partag&eacute;s avec ce mod&egrave;le. </p>
<h2>Echange</h2>
<p>Archipelago permet aux utilisateurs de r&eacute;cup&eacute;rer des donn&eacute;es de <a href="Database_fr.html">sources de donn&eacute;es</a> existantes, mais rien n'interdit &agrave; de telles sources d'&ecirc;tre d'autres serveurs Archipelago. En cons&eacute;quence, des donn&eacute;es peuvent &ecirc;tre &eacute;chang&eacute;es entre meta-mod&egrave;les qui se d&eacute;finissent leurs correspondances mutuelles. </p>
<h2>Internationalisation</h2>
<p>L'information doit &ecirc;tre pr&eacute;sent&eacute;e &agrave; l'utilsiateur de la mani&egrave;re la plus adapt&eacute;e possible. Pour cette raison, Archipelago adapte son interface utilisateur &agrave; la langue de l'utilisateur. De plus, il peut essayer d'afficher le contenu des donn&eacute;es dans la langue la plus adapt&eacute;e &agrave; l'utilisateur, lorsque des traductions sont disponibles.</p>
<table width="100%" border="0" cellpadding="0" cellspacing="0">
<tr>
<th nowrap colspan="4"><a href="/">Home</a>&nbsp;&nbsp;&gt;&nbsp;&nbsp;<a href="index.html">Archipelago</a> &nbsp;|&nbsp;&nbsp;<a href="Rationale_fr.html">Traduction fran&ccedil;aise</a> </th>
</tr>
</table>
</body>

</html>

