<html>
<head>
<title>Traitements - Archipelago</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../rr0.css" rel="stylesheet" type="text/css">
</head>
<body>
<h1>Traitements</h1>
<table width="100%" border="0" cellpadding="0" cellspacing="0">
<tr>
<th nowrap colspan="4"><a href="/">Home</a>&nbsp;&nbsp;&gt; &nbsp;<a href="index.html">Archipelago</a> &nbsp;|&nbsp;&nbsp;<a href="Processes.html">English translation </a> </th>
</tr>
</table>
<p>Au sens g&eacute;n&eacute;ral, les traitements sont tout calcul produisant des r&eacute;sultat &agrave; partir de donn&eacute;es structur&eacute;es existantes. De tels r&eacute;sultats pourraient par la suite constituer les donn&eacute;es d'entr&eacute;e d'autres traitements, constituant ainsi une cha&icirc;ne interressante de traitements.</p>
<p>Concr&ecirc;tement, les traitements peuvent aller d'une simple recherche de donn&eacute;es correspondant &agrave; des crit&egrave;res structur&eacute;es &agrave; des statistiques, en passant par des filtrages, classifications, ou une recherche de tendances ou motifs.</p>
<p>Les traitements devant reposer sur des concepts connus et accessibles, ils &eacute;taient g&eacute;n&eacute;ralement d&eacute;pendants des structures concr&egrave;tes des bases de donn&eacute;es auxquelles ils s'appliquaient. Le projet Archipelago vise a permettre au chercheur sur les ovnis de cr&eacute;er des traitements au niveau meta, de sorte qu'ils s'appliquent sur un meta-mod&egrave;le virtuel au lieu de d&eacute;pendre d'une structure de donn&eacute;es concr&egrave;te sp&eacute;cifique. Ne d&eacute;pendre que d'un meta-mod&egrave;le n'est plus un probl&egrave;me dans la mesure o&ugrave; un tel mod&egrave;le peut &ecirc;tre gard&eacute; inchang&eacute; tout en &eacute;tant mapp&eacute; sur des structures de donn&eacute;es diff&eacute;rentes, y compris d'autres meta-mod&egrave;les. </p>
<table width="100%" border="0" cellpadding="0" cellspacing="0">
<tr>
<th nowrap colspan="4"><a href="/">Home</a>&nbsp;&nbsp;&gt; &nbsp;<a href="index.html">Archipelago</a> &nbsp;|&nbsp;&nbsp;<a href="Processes.html">English translation </a> </th>
</tr>
</table>
</body>

</html>

