<html>

<head>
<title>UFO Archipelago</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../rr0.css" rel="stylesheet" type="text/css">
</head>
<body>
<h1>UFO Archipelago</h1>
<p><a href="http://rr0.org/personne/b/BeauJerome">Beau, J.</a>:  <em>Inforespace</em> n&deg; 112, juin 2006, pp. 41-42.</p>
<table width="100%" border="0" cellpadding="0" cellspacing="0">
<tr>
<th><a href="/index_fr.html">Home</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="Rationale.html">English translation</a> </th>
</tr>
</table>
<p class="abstract">Depuis de nombreuses ann&eacute;es, un grand nombre de <a href="Database_fr.html">bases de donn&eacute;es</a> ufologiques a &eacute;t&eacute; d&eacute;velopp&eacute;. Leurs incompatibilit&eacute;s mutuelles emp&ecirc;chant tout &eacute;change de donn&eacute;es, leur prolif&eacute;ration a constitu&eacute; un archipel o&ugrave; l&rsquo;absence de voies navigables emp&ecirc;che toute communication n&eacute;cessaire &agrave; la recherche et l&rsquo;acc&egrave;s &agrave; la connaissance en g&eacute;n&eacute;ral. Le remplacement de ces &icirc;lots de donn&eacute;es par des &icirc;lots plus grands, issus de fusions, ne fait qu&rsquo;accro&icirc;tre le probl&egrave;me, sans stopper la prolif&eacute;ration. Mais la question est l&agrave; : faut-il la stopper ou en tirer parti&nbsp;? </p>
<p>En <a href="../Ufology.html">ufologie</a> comme ailleurs, le but d&rsquo;une <a href="Database.html">base de donn&eacute;e</a> est de structurer l&rsquo;information pour lui appliquer des <a href="Processes_fr.html">traitements</a> automatis&eacute;s. Retrouver un cas en un clin d&rsquo;&oelig;il, les lieux d&rsquo;observation pour une date donn&eacute;e, d&eacute;gager des tendances sur une p&eacute;riode d&eacute;termin&eacute;e, ne sont que des exemples d&rsquo;une multitude d&rsquo;op&eacute;rations propos&eacute;es par les bases ufologiques d'aujourd&rsquo;hui.</p>
<h2>A chaque &icirc;le sa vision du monde</h2>
<table border="0" align="right" cellpadding="0" cellspacing="0" class="rightImage">
<caption>
L'information ufologique aujourd'hui
</caption>
<tr>
<td><img src="images/UFOAtHome.png" width="613" height="292"></td>
</tr>
</table>
<p>Un paradoxe les touche cependant&nbsp;: si chacune vise &agrave; &eacute;tudier le m&ecirc;me ph&eacute;nom&egrave;ne, aucune ne travaille sur les m&ecirc;mes donn&eacute;es. De sorte, chacun de ces &icirc;lots de donn&eacute;es est un monde en soi, en autarcie,  que ses oeill&egrave;res am&egrave;nent &agrave; d&eacute;velopper une coh&eacute;rence&nbsp;propre : s&eacute;lection de donn&eacute;es, <a href="Processes_fr.html">traitements</a> adapt&eacute;s et bien &eacute;videmment r&eacute;sultats deviennent rapidement sp&eacute;cifiques au monde auquel ils appartiennent, et sont toujours diff&eacute;rents de ceux des mondes voisins. Il n&rsquo;en faut pas plus pour cristalliser l&rsquo;ufologie en autant de chapelles.</p>
<p>Le probl&egrave;me est donc moins de travailler sur ses donn&eacute;es que de ne pas avoir pas acc&egrave;s &agrave; celles des autres. Un peu comme s'il vous fallait une paire de lunettes diff&eacute;rente pour lire chaque livre. De plus, les donn&eacute;es des bases ufologiques, bien que parlant toutes de la m&ecirc;me chose, ne racontent pas la m&ecirc;me histoire : leurs cas plus ou moins nombreux, leurs d&eacute;tails, leurs sources, leurs &eacute;valuations subjectives m&ecirc;me, sont autant de caract&eacute;ristiques qui devraient offrir une nouvelle perspective au sujet d'&eacute;tude des ufologues. Il faut lire tous ces livres, ceux existants et ceux &agrave; venir, afin de compl&eacute;ter, comparer, et enrichir les points de vue.</p>
<h2>Une fusion destructrice</h2>
<p>Une id&eacute;e pour r&eacute;soudre ce probl&egrave;me a &eacute;t&eacute; de fusionner les bases. Constituer un grand livre qui regroupe les donn&eacute;es des plus petits. Tout laisse cependant penser qu&rsquo;il s&rsquo;agit d&rsquo;un rem&egrave;de pire que le mal. Non seulement ce grand livre reste un livre, un livre de plus, avec la m&ecirc;me vision autarcique et pleine d&rsquo;inertie du sujet, mais il ajoute des d&eacute;fauts suppl&eacute;mentaires&nbsp;: une r&eacute;alisation &agrave; la difficult&eacute; exponentielle &ndash; construire la somme de livres, puis la sommes des sommes, etc. pendant que d&rsquo;autres bases naissent &ndash; mais aussi un compromis de dilution des donn&eacute;es&nbsp;: l&agrave; o&ugrave; il n&rsquo;y a la place que pour une information fusionn&eacute;e, il n&rsquo;y a plus de place pour les diff&eacute;rences qui constituent, elles aussi, une information en soi. </p>
<p>M&ecirc;me en consid&eacute;rant que le but d&rsquo;une telle base soit de ne stocker qu&rsquo;une seule v&eacute;rit&eacute; (id&eacute;alement objective, d&eacute;nu&eacute;es d&rsquo;erreurs), il ne restera qu&rsquo;&agrave; esp&eacute;rer de choisir la bonne. De fait, la fusion est partisane. Par essence, elle ne peut que m&eacute;contenter une partie des utilisateurs. Parce qu&rsquo;elle ne contiendra pas les donn&eacute;es auxquelles ils accordent cr&eacute;dit, parce qu&rsquo;elle n&rsquo;adoptera pas la structure qui leur convient, parce que les <a href="Processes_fr.html">traitements</a> qu&rsquo;ils attendent feront d&eacute;faut, parce que si elle n&rsquo;&eacute;tait pas illusoire, elle ne serait au mieux que le r&eacute;ceptacle d&rsquo;une pens&eacute;e unique, et le frein &agrave; toute innovation. Les outils n'ont pas &agrave; trier les donn&eacute;es, c'est le travail des ufologues. </p>
<h2>Laisser les donn&eacute;es l&agrave; o&ugrave; elles sont</h2>
<p>Si on ne peut aller contre la nature d&rsquo;archipel de la base des connaissances, il faut l&rsquo;exploiter. Au lieu d&rsquo;imposer un grand livre fusionn&eacute;, laissons les donn&eacute;es l&agrave; o&ugrave; elles sont, au format qui leur convient, et regardons-les avec de grandes, grandes meta-lunettes.</p>
<h3>Des donn&eacute;es sur les donn&eacute;es</h3>
<p>Une meta-base ne contient pas de donn&eacute;es. Ou plut&ocirc;t, des donn&eacute;es bien particuli&egrave;res, des donn&eacute;es qui d&eacute;crivent les donn&eacute;es&nbsp;: O&ugrave; se trouvent les bases qui d&eacute;crivent tel cas&nbsp;? Quel type de donn&eacute;es stocke telle base? Que signifie son champ X&nbsp;? A-t-il la m&ecirc;me signification que le champ Y de telle autre base&nbsp;? C&rsquo;est l&agrave; le type d&rsquo;informations stock&eacute;es dans une meta-base. Chaque fois qu&rsquo;une nouvelle base appara&icirc;t, sa description y est enregistr&eacute;e.</p>
<table border="0" align="left" cellpadding="0" cellspacing="0" class="leftImage">
<caption>
La vision de Archipelago
</caption>
<tr>
<td><img src="images/UFOAtHome_2.png" width="709" height="369"></td>
</tr>
</table>
<p>Gr&acirc;ce &agrave; ces informations, une meta-base, si elle ne contient pas les donn&eacute;es effectives, devient capable d&rsquo;aller les chercher&nbsp;: se connecter via Internet &agrave; une 1&egrave;re base en ligne, invoquer le formulaire de recherche d&rsquo;une 2&egrave;me, aspirer les pages d&rsquo;une 3&egrave;me. Les donn&eacute;es ne sont en effet pas limit&eacute;es aux bases proprement dites&nbsp;: il s&rsquo;agit de toute information accessible, et dont la structure est descriptible.</p>
<p>Mais au fait, quel int&eacute;r&ecirc;t pour une telle source de donn&eacute;es d&rsquo;&ecirc;tre reli&eacute;es &agrave; une meta-base&nbsp;? Avant de parler m&ecirc;me d&rsquo;int&eacute;r&ecirc;t, il s&rsquo;agit d&rsquo;une conviction&nbsp;: les donn&eacute;es sont l&agrave; pour &ecirc;tre partag&eacute;es par tous, pour le bien m&ecirc;me de la recherche. Ensuite, relier sa base &agrave; une meta-base, c&rsquo;est se brancher sur un r&eacute;seau o&ugrave; l&rsquo;information circule, et o&ugrave; l&rsquo;on peut donner comme recevoir. L&rsquo;information n&rsquo;est virtuellement plus ici ou l&agrave;, susceptible d&rsquo;&ecirc;tre perdue, mais capable de voyager, vers des collaborateurs, vers d&rsquo;autres lieux de sauvegarde, o&ugrave; vers d&rsquo;autres structures techniques constituant la prochaine g&eacute;n&eacute;ration de votre propre base. Combien de donn&eacute;es se trouvent-elles aujourd&rsquo;hui coinc&eacute;es, au risque de dispara&icirc;tre, dans leur logiciel qu&rsquo;il serait trop co&ucirc;teux et compliqu&eacute; de faire &eacute;voluer&nbsp;?</p>
<p>Mais une meta-base resterait d&rsquo;un int&eacute;r&ecirc;t limit&eacute; si elle n&rsquo;&eacute;tait gu&egrave;re plus qu&rsquo;un index ou un r&eacute;seau de bases. Que diriez-vous de voir toutes les bases &agrave; la fois&nbsp;? Cela semble a priori impossible, ou du moins peu exploitable. Comment un utilisateur pourrait-il tirer parti de toutes ces donn&eacute;es et structures diff&eacute;rentes&nbsp;&agrave; la fois ?</p>
<h3>Un meta-mod&egrave;le</h3>
<p>Effectivement, une telle vision &quot;totale&quot;, m&ecirc;me si elle devient possible, n&rsquo;est pas exploitable telle quelle. De fait, appliquer des <a href="Processes_fr.html">traitements</a> implique un mod&egrave;le de donn&eacute;es commun. Or ce mod&egrave;le, nous le savons, n&rsquo;existe pas. Il est propre aux bases qui stockent les donn&eacute;es, et nous savons qu&rsquo;on ne peut imposer un mod&egrave;le universel, tant chacun en a sa propre vue.</p>
<p>Mais, une vue, n&rsquo;est-ce pas apr&egrave;s tout que ce que nous cherchons &agrave; fournir ? Comme un calque appliqu&eacute; sur les donn&eacute;es totales, o&ugrave; se dessineraient les liens qui relient des concepts communs&nbsp;? Ce mod&egrave;le de donn&eacute;es virtuel est concevable. Potentiellement diff&eacute;rent pour chacun, n&rsquo;existant qu&rsquo;au niveau meta, c&rsquo;est un <a href="http://rr0.sourceforge.net/JavaDoc/org/rr0/im/business/doc-files/index.html">meta-mod&egrave;le</a>.</p>
<h3>Des traitements ind&eacute;pendants </h3>
<p>Un tel <a href="http://rr0.sourceforge.net/JavaDoc/org/rr0/im/business/doc-files/index.html">meta-mod&egrave;le</a> est ind&eacute;pendant des mod&egrave;les des bases. En cons&eacute;quence, tous les traitements qui s&rsquo;y appliquent, s&rsquo;ils exploitent diverses donn&eacute;es h&eacute;t&eacute;rog&egrave;nes au travers du m&eacute;ta-mod&egrave;le, en restent eux aussi ind&eacute;pendants. C&rsquo;est l&agrave; une s&eacute;paration cruciale&nbsp;: le mod&egrave;le de travail et ses traitements ne sont plus condamn&eacute;s &agrave; mourir avec la base &agrave; laquelle ils s&rsquo;appliquaient. On peut commencer &agrave; capitaliser dessus.</p>
<h2>Quand l'impossibilit&eacute; devient un choix </h2>
<p>On l&rsquo;aura compris, l&rsquo;introduction d&rsquo;un niveau meta au-dessus des bases n&rsquo;est pas une fusion. En fait, c&rsquo;est l&agrave; m&ecirc;me la philosophie m&ecirc;me de la d&eacute;marche&nbsp;: permettre une exploitation commune des donn&eacute;es, sans gommer les diff&eacute;rences. Il ne fait pas de doute que nombre meta-mod&egrave;les diff&eacute;rents c&oelig;xisteront, et seront incompatibles entre eux (quoique rien ne les emp&ecirc;che d&rsquo;&ecirc;tre r&eacute;unis &agrave; un niveau m&eacute;ta sup&eacute;rieur encore, selon le m&ecirc;me principe). Il ne fait pas de plus doute que nombre de bases choisiront de rester herm&eacute;tique aux meta-bases. Mais plus que de rassembler l&rsquo;ensemble des bases existantes et &agrave; venir, l&rsquo;important est de rendre la chose <em>possible</em>. Demain, l&rsquo;excuse technique au non partage des donn&eacute;es, au cloisonnement de l&rsquo;information, ne sera plus valable, et il faudra en assumer le choix. </p>
<p>___</p>
<p><em>J&eacute;r&ocirc;me Beau, 32 ans, est ing&eacute;nieur en informatique responsable d&rsquo;une &eacute;quipe de Recherche et D&eacute;veloppement chez un &eacute;diteur de logiciels fran&ccedil;ais sp&eacute;cialis&eacute; dans l&rsquo;acc&egrave;s aux donn&eacute;es. Il actif en ufologie depuis 1998, o&ugrave; il a commenc&eacute; &agrave; cr&eacute;er le site <a href="http://rr0.org/">RR0</a>. Depuis 2003 il s&rsquo;est investi dans la conception et le d&eacute;veloppement d&rsquo;outils ufologiques, tels que les projets <a href="UfoAtHome.html">UFO@home</a> et Archipelago.</em></p>
<table width="100%" border="0" cellpadding="0" cellspacing="0">
<tr>
<th nowrap colspan="4"><a href="/index_fr.html">Home</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="Rationale.html">English translation</a> </th>
</tr>
</table>
</body>

</html>

